app/Controllers/ControlPelanggan.php

    public function getpelanggan()
    {
        $model = new ModelPelanggan();
        $data = $model->findAll();
---
SELECT *
FROM `tb_pelanggan`
WHERE `tb_pelanggan`.`deleted_at` IS NULL